{
    "id": 5245698,
    "title": "Cookie manipulation (stored DOM-based)",
    "description": [
        "Stored DOM-based vulnerabilities arise when user input is stored and later embedded into a response within a part of the DOM that is then processed in an unsafe way by a client-side script. An attacker can leverage the data storage to control a part of the response (for example, a JavaScript string) that can be used to trigger the DOM-based vulnerability.",
        "DOM-based cookie manipulation arises when a script writes controllable data into the value of a cookie. An attacker may be able to use the vulnerability to construct a URL that, if visited by another application user, will set an arbitrary value in the user's cookie.",
        "The potential impact of the vulnerability depends on the role that the cookie plays within the application. If the cookie is used to control the behavior that results from certain user actions (for example, a 'production' versus 'demo' mode setting), then the attacker may be able to cause the user to perform unintended actions by manipulating the cookie's value. If the cookie is used to track the user's session, then the attacker may be able to perform a session fixation attack, in which they set the cookie's value to a valid token that they have obtained from the application, and then hijack the session during the victim user's subsequent interaction with the application.",
        "Burp Suite automatically identifies this issue using static code analysis, which may lead to false positives that are not actually exploitable. The relevant code and execution paths should be reviewed to determine whether this vulnerability is indeed present, or whether mitigations are in place that would prevent exploitation."
    ],
    "fix": {
        "effort": 0, 
        "guidance": [
            "The most effective way to avoid DOM-based cookie manipulation vulnerabilities is not to dynamically write to cookies using data that originated from any untrusted source. This behavior should never be implemented for cookies that have any role in controlling privileged actions or user sessions within the application."
        ]
    },
    "references": [
        {
            "url": "https://portswigger.net/kb/issues/00500b02_cookie-manipulation-stored-dom-based",
            "title": "CCookie manipulation (stored DOM-based)"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/565.html",
            "title": "CWE-565: Reliance on Cookies without Validation and Integrity Checking"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/829.html",
            "title": "CWE-829: Inclusion of Functionality from Untrusted Control Sphere"
        }
    ],
    "severity": "Low",
    "language": "English"
}