{
    "id": 2098688,
    "title": "Cross-origin resource sharing",
    "description": [
        "An HTML5 cross-origin resource sharing (CORS) policy controls whether and how content running on other domains can perform two-way interaction with the domain that publishes the policy. The policy is fine-grained and can apply access controls per-request based on the URL and other features of the request.",
        "If another domain is allowed by the policy, then that domain can potentially attack users of the application. If a user is logged in to the application, and visits a domain allowed by the policy, then any malicious content running on that domain can potentially retrieve content from the application, and sometimes carry out actions within the security context of the logged in user.",
        "Even if an allowed domain is not overtly malicious in itself, security vulnerabilities within that domain could potentially be leveraged by an attacker to exploit the trust relationship and attack the application that allows access. CORS policies on pages containing sensitive information should be reviewed to determine whether it is appropriate for the application to trust both the intentions and security posture of any domains granted access."
    ],
    "fix": {
        "effort": 0, 
        "guidance": [
            "Any inappropriate domains should be removed from the CORS policy"
        ]
    },
    "references": [
        {
            "url": "https://portswigger.net/kb/issues/00200600_cross-origin-resource-sharing",
            "title": "Cross-origin resource sharing"
        },
        {
            "url": "https://portswigger.net/blog/exploiting-cors-misconfigurations-for-bitcoins-and-bounties",
            "title": "Exploiting CORS Misconfigurations"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/942.html",
            "title": "CWE-942: Overly Permissive Cross-domain Whitelist"
        }
    ],
    "severity": "Information",
    "language": "English"
}