{
    "id": 5247490,
    "title": "DOM data manipulation (stored DOM-based)",
    "description": [
        "Stored DOM-based vulnerabilities arise when user input is stored and later embedded into a response within a part of the DOM that is then processed in an unsafe way by a client-side script. An attacker can leverage the data storage to control a part of the response (for example, a JavaScript string) that can be used to trigger the DOM-based vulnerability.",
        "DOM data manipulation arises when a script writes controllable data to a field within the DOM that is used within the visible UI or client-side application logic. An attacker may be able to use the vulnerability to construct a URL that, if visited by another application user, will modify the appearance or behavior of the client-side UI. An attacker may be able to leverage this to perform virtual defacement of the application, or possibly to induce the user to perform unintended actions.",
        "Burp Suite automatically identifies this issue using static code analysis, which may lead to false positives that are not actually exploitable. The relevant code and execution paths should be reviewed to determine whether this vulnerability is indeed present, or whether mitigations are in place that would prevent exploitation."
    ],
    "fix": {
        "effort": 0, 
        "guidance": [
            "The most effective way to avoid DOM-based DOM data manipulation vulnerabilities is not to dynamically write to DOM data fields any data that originated from any untrusted source. If the desired functionality of the application means that this behavior is unavoidable, then defenses must be implemented within the client-side code to prevent malicious data from being stored. In general, this is best achieved by using a whitelist of permitted values."
        ]
    },
    "references": [
        {
            "url": "https://portswigger.net/kb/issues/00501202_dom-data-manipulation-stored-dom-based",
            "title": "DOM data manipulation (stored DOM-based)"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/20.html",
            "title": "CWE-20: Improper Input Validation"
        }
    ],
    "severity": "Information",
    "language": "English"
}