{
    "id": 1051648,
    "title": "Έγχυση Κώδικα PHP (PHP Code Injection)",
    "description": [
        "Οι ευπάθειες τύπου έγχυσης κώδικα (code injection) αφορούν τους εξυπηρετητές εφαρμογών (application servers). Προκύπτουν όταν μια εφαρμογή κάνει αποδεκτά, ενσωματώνει και μεταγλωττίζει ως εκτελέσιμο κώδικα, δεδομένα που υποβάλλει ένας χρήστης μέσω μιας αλφαριθμητικής ακολουθίας (string).",
        "Στην περίπτωση που τα δεδομένα δεν επικυρώνονται αυστηρά από τους μηχανισμούς ασφαλείας της εφαρμογής, ένα επιτιθέμενος δύναται να κατασκευάσει και να υποβάλλει μια ακολουθία η οποία θα του επιτρέπει την εκτέλεση αυθαίρετου κώδικα για την εξυπηρέτηση του σκοπού του."
    ],
    "fix": {
        "effort": 0, 
        "guidance": [
            "Για την αντιμετώπιση της ευπάθειας έγχυσης κώδικα που εντοπίστηκε, συστήνονται τα κάτωθι:",
            "<bullet>Κατά την ανάπτυξη των εφαρμογών/ιστοσελίδων θα πρέπει να αποφεύγεται η δυναμική ενσωμάτωση και μεταγλώττιση των δεδομένων εισόδου που έχουν τη δυνατότητα να υποβάλλουν οι χρήστες σε εκτελέσιμο κώδικα από την εφαρμογή.</bullet>",
            "<bullet>Στην περίπτωση που η ενσωμάτωση και μεταγλώττιση των δεδομένων εισόδου απαιτείται για τη λειτουργικότητα της εφαρμογής, θα πρέπει να εφαρμόζονται αυστηροί μηχανισμοί επικύρωσης των δεδομένων αυτών. Η προσέγγιση των μηχανισμών επικύρωσης θα πρέπει να είναι τύπου “whitelisting”, ώστε να προκαθορίζονται οι αποδεκτές τιμές και τύποι δεδομένων εισόδου.</bullet>"
        ]
    },
    "references": [
        {
            "url": "https://portswigger.net/kb/issues/00100c00_php-code-injection",
            "title": "PHP code injection"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/94.html",
            "title": "CWE-94: Improper Control of Generation of Code ('Code Injection')"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/116.html",
            "title": "CWE-116: Improper Encoding or Escaping of Output"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/159.html",
            "title": "CWE-159: Failure to Sanitize Special Element"
        }
    ],
    "severity": "High",
    "language": "Greek"
}