{
    "id": 2097408,
    "title": "Cross-Site Scripting (XSS) - Stored",
    "description": [
        "Οι ευπάθειες Cross-Site Scripting, ή εν συντομία XSS, προκύπτουν στην περίπτωση κατά την οποία, δεδομένα ενός συγκεκριμένου τύπου εισέρχονται σε μια δικτυακή εφαρμογή λογισμικού, μέσω μιας μη αξιόπιστης πηγής. Τα δεδομένα αυτά αποτελούν μέρος δυναμικού περιεχομένου, το οποίο δεν έχει περάσει από ελέγχους επικύρωσης εισόδου (input validation), για να διασφαλιστεί ότι είναι αξιόπιστο.",
        "Το περιεχόμενο που προκαλεί την επίθεση, είναι συνήθως στη μορφή γλώσσας JavaScript, χωρίς όμως να περιορίζεται μόνο σε αυτό, καθώς μπορεί να εισαχθεί στην εφαρμογή και με τη μορφή HTML, Flash ή άλλου εκτελέσιμου κώδικα. Λόγω τις ικανότητας των προγραμμάτων περιήγησης ιστού (web browsers) να εκτελούν αρκετές γραμμές κώδικα, οι παραλλαγές με τις οποίες μπορεί να εμφανιστεί αυτή η επίθεση, είναι πολυάριθμες.",
        "Σε μια επίθεση XSS, ο νόμιμος χρήστης επισκέπτεται μια ιστοσελίδα ή εφαρμογή, η οποία εμφανίζεται και είναι όντως αυθεντική, με το σωστό URL στη γραμμή διευθύνσεων και ένα έγκυρο πιστοποιητικό SSL. Παρόλα αυτά, το σενάριο που περιλαμβάνεται στον κώδικα που υπέβαλλε ο κακόβουλος χρήστης θα εκτελεστεί, καθώς θα παρουσιάζεται ως μέρος της έγκυρης εφαρμογής.",
        "Οι δημοφιλέστερες μορφές που μπορούν να εμφανιστούν οι επιθέσεις αυτού του τύπου είναι δύο, οι επιθέσεις Stored XSS και Reflected XSS. Οι επιθέσεις Stored XSS προκύπτουν όταν μια δικτυακή εφαρμογή επιτρέπει σε έναν επισκέπτη να αποθηκεύει δεδομένα σε μια Βάση Δεδομένων μέσω των λειτουργιών της, με σκοπό τη μεταγενέστερη ανάκτηση και χρήση τους. Ένας κακόβουλος χρήστης μπορεί να επισκεφθεί την εφαρμογή και να υποβάλλει για αποθήκευση δεδομένα που εξυπηρετούν τον ύποπτο σκοπό του."
    ],
    "fix": {
        "effort": 0, 
        "guidance": [
            "Στις περισσότερες περιπτώσεις όπου δεδομένα ελεγχόμενα από τον χρήστη αντιγράφονται στις απαντήσεις της εφαρμογής, οι επιθέσεις τύπου Cross-Site Scripting μπορεί να αποφευχθούν σε δύο επίπεδα άμυνας:",
            "<bullet>Η είσοδος πρέπει να επικυρώνεται αυστηρά κατά την άφιξη, δεδομένου του είδους του περιεχομένου που αναμένεται να περιέχει. Για παράδειγμα, προσωπικά ονόματα πρέπει να αποτελούνται από γράμματα και ένα μικρό σύνολο τυπογραφικών συμβόλων και να είναι σχετικά μικρά, μια χρονιά γέννησης πρέπει να αποτελείται ακριβώς από τέσσερα ψηφία, οι διευθύνσεις email πρέπει να ταιριάζουν με την προκαθορισμένη κανονική έκφραση (regular expression). Είσοδοι που δεν επαληθεύονται πρέπει να απορρίπτονται.</bullet>",
            "<bullet>Η είσοδος του χρήστη πρέπει να κωδικοποιείται σε HTML κωδικοποίηση όποτε αντιγράφεται στις απαντήσεις της εφαρμογής. Όλοι οι HTML μετα-χαρακτήρες όπως &lt; &gt; &quot; ' και = πρέπει να αντικαθίστανται με τις αντίστοιχες οντότητες HTML (&amp;lt; &amp;gt; κλπ).</bullet>",
            "Σε περιπτώσεις όπου η λειτουργικότητα της εφαρμογής επιτρέπει στους χρήστες την σύνταξη περιεχομένου που περιέχει ένα υποσύνολο HTML ετικετών και ιδιοτήτων (πχ σε σχόλια σε blogs όπου επιτρέπεται μερική μορφοποίηση και σύνδεσμοι) είναι απαραίτητο να επιβεβαιώνεται ότι η είσοδος δεν περιέχει επικίνδυνη σύνταξη."
        ]
    },
    "references": [
        {
            "url": "https://portswigger.net/web-security/cross-site-scripting/stored",
            "title": "Stored XSS"
        },
        {
            "url": "https://portswigger.net/web-security/cross-site-scripting",
            "title": "Cross-site scripting"
        },
        {
            "url": "https://support.portswigger.net/customer/portal/articles/1965737-Methodology_XSS.html",
            "title": "Using Burp Scanner to Find Cross-Site Scripting (XSS) Issues"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/79.html",
            "title": "CWE-79: Improper Neutralization of Input During Web Page Generation ('Cross-site Scripting')"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/80.html",
            "title": "CWE-80: Improper Neutralization of Script-Related HTML Tags in a Web Page (Basic XSS)"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/116.html",
            "title": "CWE-116: Improper Encoding or Escaping of Output"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/159.html",
            "title": "CWE-159: Failure to Sanitize Special Element"
        }
    ],
    "severity": "High",
    "language": "Greek"
}