{
    "id": 1049344,
    "title": "Διαρροή Διαδρομής Αρχείου / Φακέλου (File Path / Directory Traversal)",
    "description": [
        "Η διαρροή της διαδρομής των αρχείων και των φακέλων αποτελεί μια αδυναμία των δικτυακών εφαρμογών, η οποία επιτρέπει σε έναν κακόβουλο χρήστη να διαβάσει αρχεία που φιλοξενούνται στον εξυπηρετητή της εφαρμογής. Τα αρχεία αυτά δύναται να περιλαμβάνουν κώδικα και δεδομένα της εφαρμογής, διαπιστευτήρια για τα στοιχεία της διάταξης στα μετόπισθεν (back-end resources), καθώς και κρίσιμα αρχεία του συστήματος.",
        "Σε ορισμένες περιπτώσεις, το επίπεδο πρόσβασης ενός κακόβουλου χρήστη μπορεί να είναι τέτοιο που να του επιτρέπει να τροποποιήσει τα διάφορα αρχεία, πετυχαίνοντας με τον τρόπο αυτό να αλλάξει δεδομένα της εφαρμογής και τον τρόπο λειτουργίας της, με τελικό σκοπό τον πλήρη έλεγχο του εξυπηρετητή."
    ],
    "fix": {
        "effort": 0, 
        "guidance": [
            "Τα συνηθέστερα μέτρα για την αντιμετώπιση της ευπάθειας διαρροής της διαδρομής των αρχείων και φακέλων μιας εφαρμογής, περιλαμβάνουν τα εξής:",
            "<bullet>Απαγόρευση της εισόδου δεδομένων από τον χρήστη στις παραμέτρους των APIs του συστήματος και γενικότερα αποφυγή της διεπαφής με το σύστημα αρχείων (filesystem) του εξυπηρετητή.</bullet>",
            "<bullet>Υποχρεωτική επικύρωση των δεδομένων εισόδου πριν την επεξεργασία τους από την εφαρμογή, εάν δεν μπορεί να αποφευχθεί η είσοδος τιμών από τους χρήστες. Εάν η παραπάνω λύση δεν μπορεί να υλοποιηθεί για κάποια συγκεκριμένη λειτουργία, θα πρέπει να ελέγχεται ότι η τιμή εισόδου συμφωνεί με ορισμένους προκαθορισμένους κανόνες, όπως για παράδειγμα η αποκλειστική χρήση αλφαριθμητικών χαρακτήρων (white listing approach).</bullet>",
            "<bullet>Μετά την επικύρωση της τιμής εισόδου, αυτή θα πρέπει να διέρχεται μέσω λειτουργίας η οποία θα κανονικοποιεί τη διαδρομή που προκύπτει, ώστε να συμφωνεί με αυτή που προβλέπεται από τη σχεδίαση της εφαρμογής.</bullet>"
        ]
    },
    "references": [
        {
            "url": "https://portswigger.net/web-security/file-path-traversal",
            "title": "Directory traversal"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/22.html",
            "title": "CWE-22: Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal')"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/23.html",
            "title": "CWE-23: Relative Path Traversal"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/35.html",
            "title": "CWE-35: Path Traversal: '.../...//'"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/36.html",
            "title": "CWE-36: Absolute Path Traversal"
        }
    ],
    "severity": "High",
    "language": "Greek"
}