{
    "id": 1049344,
    "title": "Διαρροή Διαδρομής Αρχείου / Φακέλου (File Path / Directory Traversal)",
    "description": [
        "Η Διαρροή Διαδρομής Αρχείων / Φακέλων (File Path / Directory Traversal) αποτελεί μια αδυναμία δικτυακών εφαρμογών, η οποία επιτρέπει σε έναν κακόβουλο χρήστη να διαβάσει αρχεία που φιλοξενούνται στον εξυπηρετητή της εφαρμογής. Τα αρχεία αυτά δύναται να περιλαμβάνουν κώδικα και δεδομένα της εφαρμογής, διαπιστευτήρια για τα στοιχεία της διάταξης στα μετόπισθεν (back-end resources), καθώς και κρίσιμα αρχεία του συστήματος.",
        "Σε ορισμένες περιπτώσεις, μπορεί να καταστεί δυνατό στον κακόβουλο χρήστη να γράψει στα διάφορα αρχεία που έχει πρόσβαση, πετυχαίνοντας με τον τρόπο αυτό να αλλάξει δεδομένα της εφαρμογής και τον τρόπο λειτουργίας της, με τελικό σκοπό τον πλήρη έλεγχο του εξυπηρετητή."
    ],
    "fix": {
        "effort": 0, 
        "guidance": [
            "Τα συνηθέστερα μέτρα για την αντιμετώπιση της ευπάθειας Διαρροής Διαδρομής Αρχείων / Φακέλων περιλαμβάνουν τα εξής:",
            "<bullet>Απαγόρευση της εισόδου δεδομένων από τον χρήστη στις παραμέτρους των APIs του συστήματος και γενικότερα αποφυγή της διεπαφής με το σύστημα αρχείων (filesystem) του εξυπηρετητή.</bullet>",
            "<bullet>Εάν δεν μπορεί να αποφευχθεί η είσοδος τιμών από τους χρήστες στις παραμέτρους των APIs, τα δεδομένα εισόδου θα πρέπει οπωσδήποτε να επικυρώνονται πριν την επεξεργασία τους από την εφαρμογή. Εάν η παραπάνω λύση δεν μπορεί να υλοποιηθεί για κάποια συγκεκριμένη λειτουργία, θα πρέπει να επικυρώνεται η τιμή εισόδου ώστε να συμφωνεί με ορισμένους προκαθορισμένους κανόνες, όπως για παράδειγμα αποκλειστική χρήση αλφαριθμητικών χαρακτήρων (white listing approach).</bullet>",
            "<bullet>Μετά την επικύρωση της τιμής εισόδου, αυτή θα πρέπει να διέρχεται μέσω λειτουργίας η οποία θα κανονικοποιεί τη διαδρομή που προκύπτει, ώστε να συμφωνεί με αυτή που προβλέπεται από τη σχεδίαση της εφαρμογής.</bullet>"
        ]
    },
    "references": [
        {
            "url": "https://portswigger.net/web-security/file-path-traversal",
            "title": "Directory traversal"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/22.html",
            "title": "CWE-22: Improper Limitation of a Pathname to a Restricted Directory ('Path Traversal')"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/23.html",
            "title": "CWE-23: Relative Path Traversal"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/35.html",
            "title": "CWE-35: Path Traversal: '.../...//'"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/36.html",
            "title": "CWE-36: Absolute Path Traversal"
        }
    ],
    "severity": "High",
    "language": "Greek"
}