{
    "id": 502,
    "title": "Δυσλειτουργία Αυθεντικοποίησης - Πολιτική Διαπιστευτηρίων - Εξαντλητικές Δοκιμές (Broken Authentication -  Credentials Policy - Brute Force)",
    "description": [
        "Ο μηχανισμός της αυθεντικοποίησης χρησιμοποιείται για την εξασφάλιση των δικτυακών εφαρμογών και ιστότοπων, με σκοπό να επιτρέπεται η πρόσβαση μόνο σε εξουσιοδοτημένους χρήστες. Στην περίπτωση που η αυθεντικοποίηση δεν λειτουργεί σωστά, υπάρχει περίπτωση ένας κακόβουλος χρήστης να αποκτήσει πρόσβαση στο προστατευμένο περιεχόμενο, είτε εκμαιεύοντας πληροφορίες από την εφαρμογή είτε παρακάμπτοντας τον μηχανισμό ελέγχου.",
        "Ένας τρόπος συλλογής πληροφοριών από την εφαρμογή είναι μέσω επίθεσης εξαντλητικής δομικής (brute force). Ένας επιτιθέμενος, εφόσον η υλοποίηση της εφαρμογής το επιτρέπει, μπορεί με αυτοματοποιημένο τρόπο να δοκιμάσει μεγάλο αριθμό πιθανών συνδυασμών στοιχείων αυθεντικοποίησης, μέχρι να ανακαλύψει έναν έγκυρο. Στην περίπτωση που η πολιτική διαπιστευτηρίων που χρησιμοποιεί ο οργανισμός είναι γνωστή και προβλέψιμη, το έργο του επιτιθέμενου γίνεται ευκολότερο."
    ],
    "fix": {
        "effort": 0, 
        "guidance": [
            "Για την αντιμετώπιση των επιθέσεων που εκμεταλλεύονται τη δυσλειτουργία του μηχανισμού αυθεντικοποίησης και την ευπάθεια σε επιθέσεις εξαντλητικών δοκιμών, συστήνονται τα εξής:",
            "<bullet>Υλοποίηση μηχανισμού αυθεντικοποίησης πολλαπλών παραγόντων (multi factor authentication) και υποχρεωτικός έλεγχος αυτών, για την αποτροπή επιθέσεων εξαντλητικών δοκιμών και υποκλοπής διαπιστευτηρίων.</bullet>",
            "<bullet>Εφαρμογή πολιτικής συνθηματικών και υποχρεωτική αλλαγή των προκαθορισμένων (default credentials).</bullet>",
            "<bullet>Εξασφάλιση των λειτουργιών εγγραφής χρήστη, ανάκτησης διαπιστευτηρίων και των διαδρομών των API από επιθέσεις αναγνώρισης, προβάλλοντας γενικά μηνύματα σφάλματος με τις λιγότερες δυνατές πληροφορίες σε μη εκμεταλλεύσιμη μορφή.</bullet>",
            "<bullet>Καταγραφή των όλων ανεπιτυχών προσπαθειών σύνδεσης, μπλοκάρισμα των λογαριασμών που υπερβαίνουν έναν καθορισμένο αριθμό προσπαθειών ή έναν αριθμό σε συγκεκριμένο χρονικό διάστημα και ειδοποίηση σε περίπτωση ανίχνευσης επίθεσης εξαντλητικής δοκιμής.</bullet>",
            "Ειδικότερα, για την προκειμένη περίπτωση, συστήνεται:",
            "<bullet>Εφαρμογή υποχρεωτικού ελέγχου εγκυρότητας όλων των ζητούμενων πεδίων (επώνυμο, ΑΜΚΑ, ΑΦΜ) κατά τη λειτουργία εγγραφής νέου χρήστη και αν είναι δυνατόν προσθήκη επιπλέον πεδίου/ων (πχ. όνομα).</bullet>",
            "<bullet>Υλοποίηση μηχανισμού για τον καθορισμό συγκεκριμένου αριθμού επιτρεπόμενων αιτημάτων ανά χρονικό διάστημα, με αυτόματο αποκλεισμό σε περίπτωση υπέρβασής του.</bullet>",
            "<bullet>Λήξη του χρονικού ορίου του συνδέσμου που αποστέλλεται με ηλεκτρονικό ταχυδρομείο κατά τη διαδικασία «Ανάκτησης Κωδικού Χρήστη», είτε μετά από σύντομο χρονικό διάστημα είτε αμέσως μετά τη χρήση του.</bullet>",
            "<bullet>Περιορισμός των πληροφοριών που επιστρέφει η εφαρμογή κατά την απευθείας κλήση ενός API από οποιονδήποτε χρήστη, ανεξαρτήτως ρόλου.</bullet>"
        ]
    },
    "severity": "Medium",
    "language": "Greek"
}
