{
    "id": 503,
    "title": "Εσφαλμένη Παραμετροποίηση Ασφαλείας - Αυθαίρετη Εκτέλεση Εντολών - Διαρροή Πληροφοριών (Security Misconfiguration - Arbitrary Command Execution - Information Disclosure)",
    "description": [
        "Ένας επιτιθέμενος συχνά θα προσπαθήσει να εκμεταλλευτεί παραμέτρους όπως γνωστές ευπάθειες μιας εφαρμογής ή ιστοσελίδας για τις οποίες δεν έχουν εγκατασταθεί οι αντίστοιχες ενημερώσεις ασφαλείας, προεπιλεγμένα δομικά στοιχεία που εγκαθίστανται εκ κατασκευής (default modules), δικαιώματα πρόσβασης στις διάφορες σελίδες και λειτουργίες, προεπιλεγμένα διαπιστευτήρια (default credentials) και αρχεία ή φακέλους που δεν προστατεύονται ικανοποιητικά.",
        "Ο εντοπισμός εσφαλμένης παραμετροποίησης ασφαλείας μιας εφαρμογής, μπορεί να γίνει από έναν κακόβουλο χρήστη με διάφορα εργαλεία λογισμικού που εξειδικεύονται στην εργασία αυτή, αλλά και με τυχαία πλοήγηση και δοκιμές. Τα αποτελέσματα περιλαμβάνουν συνήθως την απόκτηση πρόσβασης στις λειτουργίες της εφαρμογής, την αυθαίρετη και μη ελεγχόμενη εκτέλεση εντολών και τη διαρροή διάφορων τύπων δεδομένων των χρηστών, από προσωπικά έως ασφαλείας (πχ. κωδικοί πρόσβασης).",
        "Επίσης, τα μηνύματα και οι σελίδες σφάλματος της εφαρμογής, εάν δεν υλοποιούνται με ασφαλή τρόπο, αποτελούν σημαντική πηγή πληροφοριών για τον επιτιθέμενο, τόσο σχετικά με τις χρησιμοποιούμενες τεχνολογίες όσο και για δεδομένα των χρηστών."
    ],
    "fix": {
        "effort": 0,
        "guidance": [
            "Για την αντιμετώπιση των ευπαθειών της εσφαλμένης παραμετροποίησης ασφαλείας και της εκτέλεσης εντολών που εντοπίστηκαν στην εφαρμογή/ιστοσελίδα, συστήνονται τα κάτωθι:",
            "<bullet>Καθορισμός κατάλληλων δικαιωμάτων (permissions) των χρηστών στην πρόσβαση και διεπαφή με τα APIs και τα δομικά στοιχεία (modules) της εφαρμογής/ιστοσελίδας. Εφαρμογή περιορισμών σε στοιχεία που δεν είναι απαραίτητα για την εκτέλεση των καθηκόντων ενός χρήστη-ρόλου.</bullet>",
            "<bullet>Εξέταση της αναγκαιότητας ύπαρξης των δομικών στοιχείων και πρόσθετων (addons) που εγκαθίστανται εκ κατασκευής μαζί με την πλατφόρμα Drupal και απενεργοποίηση ή απεγκατάσταση όσων δεν απαιτούνται για τη λειτουργία της, σύμφωνα με τις επιχειρησιακές απαιτήσεις που συνοδεύουν την εφαρμογή/ιστοσελίδα.</bullet>",
            "<bullet>Λεπτομερής παραμετροποίηση των λειτουργιών της εφαρμογής/ιστοσελίδας, ώστε να εξασφαλίζεται η προβλεπόμενη συμπεριφορά κατά την εκτέλεσή τους και να αποφεύγεται η πρόσβαση και διαρροή κρίσιμων δεδομένων.</bullet>",
            "<bullet>Πρόβλεψη των πιθανών σεναρίων σφάλματος και προσεκτική υλοποίηση των μηνυμάτων, ώστε να μην αποκαλύπτουν πληροφορίες σχετικά με την εφαρμογή/ιστοσελίδα και τα δεδομένα της.</bullet>",
            "<bullet>Συμμόρφωση με την ισχύουσα πολιτική κωδικών πρόσβασης.</bullet>"
        ]
    },
    "severity": "High",
    "language": "Greek"
}
