{
    "id": 504,
    "title": "Εσφαλμένη Παραμετροποίηση Ασφαλείας - Διαρροή Ευαίσθητων Δεδομένων (Security Misconfiguration - Sensitive Data Exposure)",
    "description": [
        "Ένας επιτιθέμενος συχνά θα προσπαθήσει να εκμεταλλευτεί παραμέτρους όπως γνωστές ευπάθειες μιας εφαρμογής για τις οποίες δεν έχουν εγκατασταθεί οι αντίστοιχες ενημερώσεις ασφαλείας, τα δικαιώματα πρόσβασης στις διάφορες σελίδες, προεπιλεγμένα διαπιστευτήρια και αρχεία ή φακέλους που δεν προστατεύονται ικανοποιητικά.",
        "Ο εντοπισμός εσφαλμένης παραμετροποίησης ασφαλείας μιας εφαρμογής, μπορεί να γίνει από έναν κακόβουλο χρήστη με διάφορα εργαλεία λογισμικού που εξειδικεύονται στην εργασία αυτή, αλλά και με τυχαία πλοήγηση και δοκιμές. Το τελικό αποτέλεσμα θα είναι η απόκτηση πρόσβασης στις λειτουργίες της εφαρμογής και η διαρροή διάφορων τύπων δεδομένων των χρηστών, από προσωπικά έως ασφαλείας (πχ. κωδικοί πρόσβασης).",
        "Επίσης, τα μηνύματα και οι σελίδες σφάλματος της εφαρμογής, εάν δεν υλοποιούνται με ασφαλή τρόπο, αποτελούν σημαντική πηγή πληροφοριών για τον επιτιθέμενο, τόσο σχετικά με τις χρησιμοποιούμενες τεχνολογίες όσο και για δεδομένα των χρηστών."
    ],
    "fix": {
        "effort": 0,
        "guidance": [
            "Για την αντιμετώπιση των ευπαθειών της εσφαλμένης παραμετροποίησης ασφαλείας, της διαχείρισης σφαλμάτων και της διαρροής ευαίσθητων πληροφοριών που εντοπίστηκαν στην εφαρμογή/ιστοσελίδα, συστήνονται τα κάτωθι:",
            "<bullet>Πρόβλεψη των πιθανών σεναρίων σφάλματος και προσεκτική υλοποίηση των μηνυμάτων, ώστε να μην αποκαλύπτουν πληροφορίες σχετικά με την εφαρμογή και τα δεδομένα.</bullet>",
            "<bullet>Αποφυγή αποθήκευσης δεδομένων στην τοπική μνήμη του προγράμματος περιήγησης. Αν απαιτούνται για τη λειτουργικότητα της εφαρμογής, θα πρέπει να είναι σε μη αναγνώσιμη και εκμεταλλεύσιμη μορφή.</bullet>",
            "<bullet>Καθορισμός κατάλληλων δικαιωμάτων (permissions) στη διεπαφή με τα APIs της εφαρμογής και απαγόρευση υποβολής πολλαπλών αιτημάτων με αυτοματοποιημένο τρόπο και από οποιαδήποτε προέλευση.</bullet>",
            "<bullet>Συμμόρφωση με την ισχύουσα πολιτική κωδικών πρόσβασης.</bullet>"
        ]
    },
    "severity": "High",
    "language": "Greek"
}
