{
    "id": 505,
    "title": "Απαρίθμηση Χρηστών (User Enumeration)",
    "description": [
        "Η απαρίθμηση χρηστών είναι η ευπάθεια των δικτυακών εφαρμογών, η οποία συνίσταται στην ικανότητα ενός επιτιθέμενου, είτε να μαντέψει είτε να επαληθεύσει έγκυρους χρήστες ενός συστήματος.",
        "Η συγκεκριμένη ευπάθεια εμφανίζεται συνήθως στη σελίδα σύνδεσης (login page) ή στη λειτουργία &laquo;Υπενθύμισης Κωδικού&raquo; (forgot password) μιας εφαρμογής. Ένας κακόβουλος χρήστης υποβάλλει διάφορους συνδυασμούς διαπιστευτηρίων (όνομα χρήστη και κωδικός πρόσβασης) και έπειτα εντοπίζει διαφορές στις απαντήσεις που επιστρέφει ο εξυπηρετητής, αναλόγως της εγκυρότητας των διαπιστευτηρίων που υποβάλλονται.",
        "Σε ένα τυπικό παράδειγμα εμφάνισης αυτής της ευπάθειας, η υποβολή ενός ονόματος χρήστη το οποίο δεν υπάρχει στην εφαρμογή, έχει ως αποτέλεσμα την επιστροφή του μηνύματος &laquo;Ο χρήστης δεν υπάρχει&raquo;. Αντίθετα, η υποβολή ενός συνδυασμού υπαρκτού ονόματος χρήστη και λανθασμένου κωδικού πρόσβασης, επιστρέφει το μήνυμα &laquo;Λανθασμένος κωδικός πρόσβασης&raquo;, το οποίο οδηγεί τον επιτιθέμενο στη διαπίστωση πως το δεύτερο όνομα χρήστη υπάρχει στην εφαρμογή.",
        "(Κίνδυνος)Στην περίπτωση κατά την οποία ένας κακόβουλος χρήστης καταφέρει να δημιουργήσει μια λίστα υπαρκτών χρηστών σε μια εφαρμογή, μπορεί στη συνέχεια να τη χρησιμοποιήσει ώστε να στοχοποιήσει το πεδίο του κωδικού πρόσβασης, προσβάλλοντάς το με μια επίθεση εξαντλητικής δοκιμής (brute force attack). Εάν δεν εφαρμόζεται μια ικανοποιητική πολιτική κωδικών πρόσβασης, είναι πολύ πιθανό τελικά ο επιτιθέμενος να αποκτήσει πρόσβαση στην εφαρμογή, με δικαιώματα αντίστοιχα με αυτά του ευάλωτου χρήστη."
    ],
    "fix": {
        "effort": 0,
        "guidance": [
            "Για την αντιμετώπιση της ευπάθειας της απαρίθμησης χρηστών η οποία εμφανίζεται στη σελίδα σύνδεσης μιας εφαρμογής, συστήνεται η επιστροφή ενός γενικού μηνύματος σφάλματος από τον εξυπηρετητή, το οποίο δεν θα αποκαλύπτει περαιτέρω λεπτομέρειες σχετικά με το πεδίο και την τιμή που προκάλεσε το σφάλμα. Ένα ενδεικτικό μήνυμα μπορεί να είναι το &laquo;Ο συνδυασμός ονόματος χρήστη και κωδικού πρόσβασης δεν είναι έγκυρος&raquo;.",
            "Επιπρόσθετα, εάν η ευπάθεια εμφανίζεται στη λειτουργία &laquo;Υπενθύμισης Κωδικού&raquo;, τότε θα πρέπει και πάλι να επιστρέφεται ένα γενικό μήνυμα, το οποίο ενδεικτικά μπορεί να αναφέρει &laquo;Ένα μήνυμα email έχει σταλεί στη δνση ηλεκτρονικού ταχυδρομείου του χρήστη.&raquo;"
        ]
    },
    "severity": "High",
    "language": "Greek"
}
