{
    "id": 5244416,
    "title": "Έλλειψη Σήμανσης “secure” και “httpOnly” στα Αναγνωριστικά Συνόδου (Session Cookies without &quot;secure&quot; and &quot;httpOnly&quot; flags)",
    "description": [
        "Η σήμανση (flag) με όνομα “secure” αποδίδεται σε ένα αναγνωριστικό συνόδου (session cookie), ώστε να μην είναι δυνατή η αποστολή του όταν μεταδίδεται μέσω μη ασφαλούς επικοινωνίας (πχ. πρωτόκολλο http αντί https).",
        "Επιπλέον ένας επιτιθέμενος μπορεί, εκμεταλλευόμενος την ευπάθεια μιας εφαρμογής σε επιθέσεις τύπου Cross-Site Scripting (XSS), να αναγνώσει και να υποκλέψει το αναγνωριστικό συνόδου ενός νόμιμου χρήστη, με τη χρήση απλών εντολών της γλώσσας JavaScript. Για την αποτροπή αυτής της επίθεσης χρησιμοποιείται η σήμανση “httpOnly”, η οποία απαγορεύει την πρόσβαση στα cookies μέσω JavaScript. Σε αντίθετη περίπτωση, η απουσία της σήμανσης καθιστά το αναγνωριστικό εκμεταλλεύσιμο."
    ],
    "fix": {
        "effort": 0, 
        "guidance": [
            "Για την αντιμετώπιση της ευπάθειας έλλειψης των σημάνσεων “secure” και “httpOnly” στα αναγνωριστικά συνόδου της εφαρμογής, συστήνονται τα κάτωθι:",
            "<bullet>Σε κάθε αίτημα (request) προς την εφαρμογή, θα πρέπει τα χρησιμοποιούμενα αναγνωριστικά συνόδου (cookies) να αντιστοιχίζονται αποκλειστικά με τη σύνοδο του κάθε χρήστη, με ασφαλή τρόπο.</bullet>",
            "<bullet>Να ορισθούν τα flags “secure” καθώς και “httpOnly” σε όλα τα αναγνωριστικά συνόδου, μέσω των ρυθμίσεων του εξυπηρετητή.</bullet>"
        ]
    },
    "references": [
        {
            "url": "https://portswigger.net/kb/issues/00500600_cookie-without-httponly-flag-set",
            "title": "Cookie without HttpOnly flag set"
        },
        {
            "url": "https://www.owasp.org/index.php/HttpOnly",
            "title": "Configuring HttpOnly"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/16.html",
            "title": "CWE-16: Configuration"
        }
    ],
    "severity": "Low",
    "language": "Greek"
}