{
    "id": 5245312,
    "title": "Μη Ελεγχόμενη Μεταφόρτωση Αρχείων",
    "description": [
        "Το πρώτο βήμα για την προσβολή ενός συστήματος αποτελεί συνήθως η επίτευξη εκτέλεσης κώδικα σε αυτό. Τα αρχεία που μεταφορτώνονται από τους χρήστες μιας εφαρμογής στον εξυπηρετητή μέσω αντίστοιχης λειτουργικότητας, αποτελούν πιθανό σημείο κινδύνου για την ασφάλειά της και μπορούν να εξυπηρετήσουν το σκοπό που περιεγράφηκε, ειδικότερα όταν δεν επικυρώνεται το είδος και το περιεχόμενό τους.",
        "Οι συνέπειες που μπορεί να έχει η μη ελεγχόμενη μεταφόρτωση αρχείων δύναται να περιλαμβάνουν την απομακρυσμένη εκτέλεση εντολών, τον πλήρη έλεγχο του συστήματος, την υπερφόρτωση του συστήματος αρχείων ή της βάσης δεδομένων, την προώθηση επιθέσεων σε άλλα συστήματα της υποδομής καθώς και την παραποίηση των σελίδων της εφαρμογής (defacement)."
    ],
    "fix": {
        "effort": 0,
        "guidance": [
            "Για την αντιμετώπιση της ευπάθειας Μη Ελεγχόμενης Μεταφόρτωσης Αρχείων συστήνονται τα κάτωθι:",
            "<bullet>Απόδοση ονόματος που θα παράγεται από τον εξυπηρετητή σε κάθε αρχείο που μεταφορτώνεται.</bullet>",
            "<bullet>Εξέταση του περιεχομένου των αρχείων που μεταφορτώνονται και καθορισμός μιας λίστας επιτρεπόμενων, μη εκτελέσιμων τύπων αρχείων (file type white listing). Επιπλέον, πρόβλεψη και απαγόρευση των συνηθέστερων τύπων εκτελέσιμων αρχείων (executable file type black listing).</bullet>",
            "<bullet>Καθορισμός λίστας επιτρεπόμενων καταλήξεων αρχείων (file extension white listing).</bullet>",
            "<bullet>Εφόσον δεν απαιτείται για τη λειτουργία της εφαρμογής, απαγόρευση μεταφόρτωσης συμπιεσμένων αρχείων (πχ .zip).</bullet>",
            "<bullet>Καθορισμός επιτρεπόμενου μεγέθους αρχείων προς μεταφόρτωση.</bullet>"
        ]
    },
    "references": [
        {
            "url": "https://portswigger.net/kb/issues/00500980_file-upload-functionality",
            "title": "File upload functionality"
        },
        {
            "url": "https://github.com/cure53/H5SC/tree/master/attachments",
            "title": "Various proof-of-concept files"
        },
        {
            "url": "https://labs.detectify.com/2015/05/28/building-an-xss-polyglot-through-swf-and-csp/",
            "title": "An XSS polyglot attack"
        },
        {
            "url": "https://cwe.mitre.org/data/definitions/434.html",
            "title": "CWE-434: Unrestricted Upload of File with Dangerous Type"
        }
    ],
    "severity": "Information",
    "language": "Greek"
}
